{"timestamp": 1772078074.019608, "content": "Counseling and Health Services| SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Counseling and Health Services Health Insurance Requirement SIUE requires full-time students with at least one on-ground class to have health insurance. Learn More Faculty and Staff Resources Learn methods to assist a student in distress. Learn More Are You a New Student? Immunization records are due to Health Service by the 1st day of class. Learn More Emergency and After Hours Care What to do if you need care outside of office hours. Learn More Services Available Schedule medical and mental health appointments Monday through Friday. Learn More Welcome to Counseling and Health Services SIUE Counseling and Health Services is committed to providing compassionate and inclusive outpatient clinical care to promote and maintain the health and overall well-being of our students. Walk-ins are welcome, however, to serve you most efficiently, we ask you to schedule an appointment with one of our healthcare providers. Enrolled students may make an appointment by calling 618-650-2842 or by visiting us on the lower level of the Student Success Center , Room 0222 (adjacent to the Visitor Parking Lot B). We look forward to supporting your health and well-being as the “home” for all your medical and behavioral health needs. About Read announcements or contact a team member. Type of Visit Schedule a medical or mental health appointment. Immunization Learn more about immunization requirements or submit proof of immunity. Insurance Learn how to obtain student health insurance or submit a waiver during the designated period each academic year. Resources Apply for one of our internship programs or learn more about mental health and suicide prevention. Health Promotion Schedule a health presentation, interview or training, or request health materials. Â"}