{"timestamp": 1772078074.2514298, "content": "Mental Health - Type of Visit - Counseling and Health Services | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Counseling and Health Services About Type of Visit Immunization Insurance Resources Health Promotion Type of Visit Counseling and Health Services Type of Visit Mental Health Medical Services, Lab and Pharmacy Emergency Schedule an Appointment Medical Excuses Mental Health Appointments Office Hours Monday – Thursday 8:00 a.m. - 4:30 p.m., and Friday 8:00 a.m. - 4:00 p.m. Please walk in to begin services. *if you are a remote student, or are primarily located away from main campus, please call our office (618-650-2842) to schedule a behavioral health consultation. We are able to serve students remotely who are located in Illinois or Missouri Behavioral Health Consults (BHC): Initial BHC appointments are conducted in-person. Given the information provided by the student, the Provider and Student will determine which treatment mode is in the best interest of the student using our stepped care model. Subsequent appointments may be scheduled in-person or virtually. Skills Sessions: Skills sessions help students build practical tools for managing stress, improving focus and organization, fostering self-kindness, and developing healthy coping strategies to support academic success and overall well-being. Psycho-Educational Workshops: Psychoeducational workshops are offered on a regular basis to support students who are navigating mental health concerns. Click here for current semester offerings . Group Counseling: Group counseling is generally highly effective for many psychological and interpersonal issues – especially for concerns involving relationships, social skills, or shared life challenges. Click here for current semester offerings . Psychological Assessments: (currently paused until March 2026) Psychological Assessment consists of a clinical interview, testing and collaborative reports often used to support students requesting accommodation or related services. Our clinical team is skilled in assessing Autism Spectrum Disorder, Attention Deficit/Hyperactivity Disorder, Specific Learning Disorders, and differential diagnoses for mental health conditions. If you are interested in pursuing a psychological assessment, you will start with a behavioral health consultation appointment. Individual Counseling: We provide short-term, solution-focused individual counseling. Concerns that may be addressed in individual counseling include life transitions, interpersonal difficulties, stress, anxiety, depression, family concerns, eating concerns, etc. Students can access 12 individual counseling visits per academic year through SIUE Counseling Services at no charge. If more than 12 sessions are needed in an academic year, a $15 charge per each additional session will be assessed. How do I access my visit? For in-person appointments, you will check in at the front desk of Counseling and Health Services (SSC Room 0222). For virtual initial visits, your provider will send you instructions on how to access videoconferencing via secure message. Virtual Appointments Disclaimer: Your provider can practice in Illinois. Some providers may also be able to practice virtually in Missouri. If you need to access services from another state, you’ll need to consult with your provider to determine eligibility. What space and technology are required for teletherapy? A quiet, private location is necessary for teletherapy appointments to allow for personal, confidential conversations. For videoconferencing, a computer with a web camera and microphone, or a cell phone, is required, as well as reliable WiFi. If you do not have access to all of the technology necessary for videoconferencing, please email cougarcare@siue.edu. If you are getting connected with a provider for the first time or are currently working with a provider, it is important to be checking CougarCare and responding to secure messages from your provider to ensure minimal delays. To best protect your information, providers at Counseling Services use CougarCare , rather than normal email addresses for communication. All Counseling Services programs are open to all eligible students regardless of race, color, national origin, or other protected characteristics. Reasonable accommodations are available upon request. Â"}