{"timestamp": 1772073199.4231637, "content": "Southern Illinois University Edwardsville | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Visit Campus Schedule your campus visit today! Learn More Life on Campus Get involved at SIUE. Learn More Academic Excellence An SIUE education will prepare you for a successful career. Learn more Beyond the Classroom SIUE students are challenged to think critically. Learn More SIUE Cougars Cheer on your SIUE Cougars! Learn More Discover SIUE Own Tomorrow Graduate School Online Learning News SIUEâs Tandra Taylor, PhD, Named Assistant Vice ChancellorÂ for Educational Pathways and Community Engagement February 23, 2026, 10:00 AM After a national search, Tandra Taylor, PhD, is Southern Illinois University Edwardsville’s new Assistant Vice Chancellor for Educational Pathways and Community Engagement. In this role,... SIUEâs Learning Resource Center on the Wyvetter H. Younge Higher Education Campus Hosts Sheroes in Education for Womenâs History Month February 24, 2026, 8:52 PM Kiyoko Proctor Earns Player and Freshman of the Week Honors from the OVC February 24, 2026, 1:45 PM Read more in News Campus Scenes University Calendar Give to SIUE Â"}