{"timestamp": 1771218263.4725645, "content": "Student Competitions - SIUE School of Engineering | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses School of Engineering Programs & Departments Visit/Tour Financial Opportunities Student Life Advisement About the School Student Life School of Engineering Student Life Student Life Overview Housing/FIC Peer Mentoring Student Involvement Student Organizations Student Competitions Academic Excellence SIUE Student Life Student Competitions Mini Baja and solar car races...bridge-building and robotics competitions. Engineering students are continually putting their knowledge - and competitive spirit - to the test. If you are interested in participating on a student design team, contact the leader of that team (see Student Organizations for contact information). Our student design teams consistently place well in regional and national competitions. SIUE School of Engineering Solar Car Team Races in Annual Formula Sun Grand Prix The School of Engineering solar car team achieved a new personal best at the 2015 Formula Sun Grand Prix (FSGP) in Austin, Texas. The School’s Black Nova completed 66 laps and covered more than 226 miles, five times more than last year’s total. SIUE was one of 15 universities from the U.S. and Canada that competed July 26-31 at the Circuit of the Americas in Austin. This year’s team consisted of six SIUE students: Zachary Crawford, Preston Steffey, Zack Endsley, Blake Fry, Cody Lynn and Ryan Maitland; and three SIUE alumni: Alex Wolff, Matt Boone and Calvin Walker. The primary drivers were Endsley and Steffey. Serving as advisors to the team were Dr. Andrzej Lozowski, associate professor in the Department of Electrical and Computer Engineering, and Steve Muren, lab manager/instructor in the Department of Electrical and Computer Engineering. “In years past, our car has struggled to make it up the 13-story incline at turn one,” said Crawford, project director. “However this year, the car had no trouble scaling the hill thanks to our new NuGen Mobility motor. We completed 66 laps, five times more than ever before – and all on sun power!” Industrial Engineering Students Win SIUE’s “TheOther40” Competition Future business leaders and entrepreneurial hopefuls at Southern Illinois University Edwardsville pitched business plans to a panel of enterprise professionals in hopes of winning the fifth annual “TheOther40” competition. The event resembled the hit show “Shark Tank,” in which the creators of seven businesses worked to prove the future success of their start-up. Students’ pitched their plans to a panel of judges, including Larry Heitz, business executive and entrepreneur, and the first person to graduate with a master’s in business administration from SIUE. Jim Pennekamp, executive director of University Park at SIUE, and Tim Whitten, business counselor for Justine Petersen, completed the panel. Senior industrial engineering students Anilcan Akay, Alp Yetgin, Damla Gungor and Bahar Sahin won first place and $5,000 for BADA, a two-player brain-builder game aimed at helping the development of math skills and the memory of children ages seven and up. The game's creators are from Turkey and are completing the University’s dual-diploma program with Istanbul Technical University. “We emphasized that there is a gap in the market for a brain builder game like ours,” explained Akay. “The competition was tough, but we’re excited to have taken part in this valuable experience and earned first place.” SIUE Solar Car Takes Home Award at American Solar Challenge The SIUE Solar Car Team was awarded the Fastest Stop in the Dynamics Brake Test award and placed 13th out of 20 total cars at the 2014 American Solar Challenge Formula Sun Grand Prix race during July in Austin, Texas. The SIUE Solar Car Team’s goals are to design, build and race solar cars powered entirely by the sun’s energy. The team races against other colleges from the U.S. and from around the world. The organized group enables students from all majors to learn about solar energy, apply hands-on knowledge and create a unique project. “We have made significant improvements from last year’s competition including upgrading the solar array and batteries,” said Dr. Andy Lozowski, associate professor of electrical and computer engineering. “Our next tasks will be to upgrade the motor and the motor controller, and building the lower body for improved looks and aerodynamics.” SIUE Engineering Students Nab 3rd at International HPV Challenge A team of 13 SIUE mechanical engineering students won third place in the endurance category at the American Society of Mechanical Engineers’ Human Powered Vehicle Challenge in Orlando, Fla. More than 30 teams vied in the international competition. SIUE’s finished product–a three-wheeled, steel-framed, recumbent vehicle–was the culmination of two semesters’ worth of work, according to mechanical engineering senior Terrence Brown. Dr. Soondo Kweon, assistant professor in the Department of Mechanical and Industrial Engineering, supervised and led the students as their faculty advisor. To compete in the endurance category, teams’ self-engineered vehicles had to complete as many laps as possible within 2.5 hours on a two-lane obstacle course replete with hairpin turns, rumble strips and more. Six team members took turns as drivers. Mere days before the competition when SIUE team members were already in Orlando prepping for their event, they had to cope with an unanticipated malfunction. “Our (gear) shifter broke,” said senior Morgan Hemker, ASME SIUE chapter president. “We weren’t able to fix it in time, but we still had shifting capability with the front gearing. It took us from a 10-speed to a three-speed, but we made it work.” Senior Hayden Sievers said staying the course, especially in light of the gearshift mishap, made him proud to be a part of the team and to win third place in the endurance category. “Last year we won fourth place in endurance,” Sievers said. “We were one of very few three-wheeled HPVs in the event, but this year the majority of competitors designed theirs with three (vs. two) wheels.” Applying engineering principles and competing in a real-world event, sophomore Lauren Bailey said, was definitely time well spent. “The ASME HPV Challenge brought it all to life and made our hard work worthwhile,” she said. “It was exciting. Several of us competed last year, too, and we’ll be back next year.” SIUE Construction Management Students Claim 4th Place in International Competition Six SIUE School of Engineering construction management students successfully competed at the American Concrete Institute (ACI) Spring 2014 Convention in Reno, Nevada. The SIUE team finished fourth in the Concrete Bowling Ball competition and 11th overall. SIUE competed against 31 teams from Canada, Ecuador, Mexico, Puerto Rico and the U.S. Each team entered bowling balls made of concrete. The balls were evaluated on the mass and diameter, as well as toughness, deformation and bowling performance. In addition to their strong performance in competition, the SIUE ACI chapter accepted the 2013 Excellent University Award, the highest award for ACI Student Chapters. The chapter earned the award for its outstanding student and faculty involvement in ACI committees, meetings, events and community outreach. “The SIUE ACI chapter continues to demonstrate excellent teamwork and performance in international competition,” said Dr. Chris Gordon, School of Engineering associate dean and chair of the Department of Construction. “Dr. Anne Werner and the ACI leadership team have a clear passion for concrete. “Through their hard work, our students have honed their leadership skills, gained beneficial experience in concrete material behavior and amplified SIUE’s outstanding reputation in concrete construction.” SIUE Solar Car Team Competes in American Solar Challenge Formula Sun Grand Prix The SIUE Solar Car Team joined 11 other teams at the University of Texas at Austin to complete in the American Solar Challenge Formula Sun Grand Prix (FSGP). The FSGP is a biannual track race that is held on grand prix or road style closed courses. This unique style of solar car racing is open to teams from around the world and tests the limits of the vehicles in handling curves, braking and acceleration. Driver training, passing strategy and quick pit stops are crucial for teams racing in FSGP. SIUE’s team finished eighth by completing 10 laps after enduring high temperatures of 108 degrees and track temperatures exceeding 140 degrees. They also claimed the Spirit of the Event Award for their persistence and dedication throughout the event. “Despite the outrageous heat, lack of sleep and 18-hour days, we persistently worked together toward getting our car on the track every race day,” said Amy Sunderlin, an electrical engineering graduate student and team captain. “I am proud to be a part of a team that continues to strive to complete our goals, despite the challenges it takes to accomplish them.” Each team had to ensure that their car met a variety of structural, electrical, mechanical and functional standards before passing “scrutineering” and being allowed on the track. Although the teams were competing against one another on the track, they were extremely collegial off the track. “We all helped each other out whenever we could,” Sunderlin said. “We received help from Oregon State, where they gave us critical fasteners that we needed to pass scrutineering. I worked with Missouri S&T to help them with their battery management coding problems. There is a very long list of people who helped us, and who we have helped, and it happens across all of the teams.” SIUE Solar Car Team Faculty Advisors Andy Lozowski, Associate Professor in Electrical & Computer Engineering Steve Muren, Electrical & Computer Engineering Lab Manager and Lecturer Team Captain Amy Sunderlin, Electrical Engineering graduate student Team Members Matt Boone, Senior, Electrical and Computer Engineering Zachary Crawford, Junior, Mechanical Engineering Nate Fox, Senior, Mechanical Engineering Derek Freiburghaus, Business Administration Alum Mark Matthews, Senior, Mechanical Engineering Nic Meyer, Junior, Electrical and Computer Engineering Curtis Mueth, Junior, Electrical and Computer Engineering Louis Neumeyer, Junior, Computer Science Travis Powers, Senior, Industrial and Manufacturing Engineering Lisa Smith, Sophomore, Electrical and Computer Engineering Marc Wilmsmeyer, Senior, Mechanical Engineering Alex Wolff, Industrial Engineering Alum SIUE Student ASCE Chapter brings steel bridges and concrete canoes to campus More than 300 civil engineering students and faculty from 15 Midwest universities traveled to SIUE To put their engineering knowledge - and competitive spirit - to the test. The SIUE student chapter of the American Society of Civil Engineers (ASCE) hosted the Mid-Continent Student Conference in April. \"The many competitive activities provide numerous opportunities for the students to put into practice what they learn in the classroom,\" said Brent Vaughn, laboratory specialist and lecturer in the School of Engineering, and the faculty advisor to the student ASCE chapter. \"They learn about time and cost management, and most importantly learn to work with team members to achieve goals. Many employers look for students who have demonstrated their skills and initiative with these projects.\" The conference began with a steel bridge competition. Students erected bridges in a timed event across a hypothetical river following a set of worksite rules. Each bridge was then loaded with 2,500 pounds of steel, while key points on the bridge were carefully monitored for deflection. Three events were held: A Paper Presentation Competition - Student authors presented and defended their unpublished papers on \"Body of Knowledge - Is It Ethical to Associate Credentials with Competency?\" A Geo-wall Competition - Students designed and built model mechanically stabilized earth retaining walls using paper reinforcement taped to a poster board wall facing. The goal was to use the least amount of reinforcement to support the retained soil and both vertical and horizontal loads. A Concrete Bowling Competition - Students designed and constructed a concrete bowling ball that was practical, durable and aesthetically pleasing. The event was divided into two parts: bowling ball design and a bowling competition where teams bowled five frames. The highlight of the competition was the concrete canoe races held at the SIUE Cougar Lake Marina. Teams brought concrete canoes that they had designed and fabricated. After being judged on design, surviving the dunk test and a formal oral presentation, teams competed in various races with two, three or four paddlers. The University of Oklahoma took the top spot in this year's concrete canoe competition. The SIUE Concrete Canoe Team won last year's competition, which was held at the University of Nebraska-Lincoln. \"This conference gives civil engineering students excellent experience in project management, team building and leadership,\" says Evan Wilson, chair of the conference and a senior in SIUE's civil engineering program. \"The competition teams enable us to develop professionally, personally and academically to become more capable engineers. We also get to work with our hands, along with our minds, to complete some truly unique projects.\" Â"}