{"timestamp": 1772078074.1224635, "content": "Mission, Vision and Values - About - Counseling and Health Services | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Counseling and Health Services About Type of Visit Immunization Insurance Resources Health Promotion About Counseling and Health Services About Mission Meet the Team Announcements & Events Privacy Notice Contact Us Mission, Vision and Values Mission Our integrated team delivers compassionate, inclusive, comprehensive medical and behavioral health services that support student wellbeing, promote resilience, and limit interruptions in academic pursuits with a student-centered focus consistent with the mission of SIUE. Vision We aspire to foster a campus hub that supports the mind and body – an environment where students are equipped to excel and lead fulfilling lives. Values Student-Centered - We recognize every student is unique and strive to provide tailored support that addresses individual health concerns, backgrounds, and preferences. Quality - We are dedicated to providing high-quality healthcare services that meet the highest standards of care. Our commitment to excellence ensures that students receive the best possible support for their physical and mental well-being. Equity - We strive to create a fair and inclusive healthcare environment where all students have equal access to high-quality services, regardless of their background, identity, or circumstances. Community Engagement - We believe that strong partnerships with students, faculty, and local organizations enhance our ability to promote health and well-being. We actively seek collaborative opportunities to address the needs of our campus community. Â"}