{"timestamp": 1771893557.7328663, "content": "University Housing - Home | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses University Housing Home Sweet Home, Cougar! Submit a maintenance request or learn how to get involved within Housing. Learn More Welcome to Campus Welcome home! On-campus residents benefit from a supportive community, numerous amenities and on-site housing staff, all for a great value. Housing residents foster friendships within their communities, connect with faculty and staff, and take advantage of countless opportunities for personal and academic growth. Each resident has the opportunity to create a unique experience in a number of different ways: Active involvement in housing student leadership Participation in a Living Learning Community (LLC) , is a unique opportunity to live with students who have similar areas of interest or study. These communities foster academic success and faculty interaction and provide specialized programs and activities for residents. Staff interactions Wing community participation University Housing offers a variety of resources to support residents at various points in their academic careers. All first-time, full-time students who graduated high school within the last 12 months and are not commuting less than 60 miles from their legal parent/guardian home address must live on campus. To view the required housing policy and information about the exemption process, please visit the Residency Requirement page. Housing Options Students are given either a general assignment or a living learning community (LLC) assignment in one of our five housing options. Application, Costs & Forms Information about the SIUE Required Housing Policy, how to apply, costs and University Housing forms can be found here. Move-In Students can find general information about move-in, the process, and their move-in date and time. FAQ We’ll answer all of your questions concerning moving in and living on campus. Current Residents Whether you need to submit a maintenance request or are looking to get involved, we are here to support your success. About University Housing employs helpful staff who are committed to serving your needs 24 hours a day, 365 days a year. Apply For Housing My Housing Â"}