{"timestamp": 1772073219.127211, "content": "Tutoring Resource Center - Learning Support Services | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Learning Support Services About Us Developmental Courses Tutoring Resource Center Writing Center Supplemental Instruction Meet the Team Tutoring Resource Center Learning Support Services Tutoring Resource Center Overview Online Tutoring Policies Tutorial Videos Meet the Tutors Connect Social at SIUE Welcome to the Tutoring Resource Center! The Tutoring Resource Center provides both face-to-face and online tutoring. The purpose of the Tutoring Resource Center is to help students succeed in their courses in a supportive learning environment. We are located in the Student Success Center 1252 and open for face-to-face and online appointments. Students who need assistance with their SIUE courses are welcome to walk-in or schedule an appointment. Handouts, computer software (Mathematica, Matlab, SPSS), and calculators also are available. Schedule Now Available at https://siue.mywconline.com How to make appointments - Click on https://siue.mywconline.com You may be prompted to enter your SIUE user name and password. Once on the schedule, select \"limit to\" in order to view classes we currently offer tutoring in. Select the class and then in any of the white squares that work with your schedule click and fill out the appointment form. Once you have successfully made an appointment, you will receive an email confirmation in your SIUE email account. If you are more than 10 minutes late for any appointment it will be cancelled, and missing more than 4 appointments in a semester without cancelling can result in your account being frozen. WE ARE CLOSED WHEN CLASSES ARE NOT IN SESSION AND ALL UNIVERSITY APPROVED HOLIDAYS. Current Classes Offered For Tutoring (Spring 2026): For the most up to day list of classes please visit the scheduling website https://siue.mywconline.com ACCT 200, 210 B IOL 111, 140, 150, 151, 190, 220, 240A, 250, 327, 350 CE 240 CHEM 113, 120A, 120B, 121A, 121B, 131, 241A, 241B, 351 CMIS 108, 130, 234, 270, 310, 330, 342, 350, 351, 352, 451 CS 108, 111, 140, 150, 234, 286, 314, 321, 325, 340, 360, 382 ECE 210, 282, 351 ECON 111, 112 FIN 320 GBA 301 GEOG 320, 418, 420, 422 IE 106 MATH 112, 112A, 112B, 115, 116, 120, 120E, 120I, 125, 145, 150, 152, 224, 250, 305 MGMT 330, 331 MKTG 300 MS 251 MUS 111, 125, 126, 225, 267, 309, 367 NURS 231, 234 PBHE 111, 230, 305 PSYC 111, 200, 201, 206, 208, 220, 221, 303, 314, 340, 407, 409, 431, 450, 494, 520 QR 101 RA 101 SCM 315 SOC 111, 301, 304, 309 SPPA 210, 220, 231, 250, 312, 321, 322, 361, 397, 414, 441, 442, 446 STAT 380 GENERAL STUDY SKILLS PLANNING AND ORGANIZATIONAL SKILLS NOTE-TAKING STRATEGIES TIME MANAGEMENT EDUCATION CONTENT TEST ELEMENTARY EDUCATION PROGRAM To View the Engineering Building Drop In Tutoring Schedule Please Visit www.siue.mywconline.com and Select Tutoring Center Schedule. Private High School Tutoring Private, fee-based tutoring may be available for area high school math and science students by contacting Bethany Guida at bguida@siue.edu . Â"}