{"timestamp": 1771217409.6749067, "content": "Dining Services | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Dining Services Daily Menu View our daily menu and nutritional information on Nutrislice. More Info Join the Team See available positions within Dining Services. Learn More Catering Services SIUE Catering offers full-service catering ranging from plated dinners to buffet receptions. More Info SIUE Dining Cares Questions or concerns about your dining experience? Contact Us Welcome to Dining Services SIUE Dining Services provides students, faculty, staff and the surrounding community with quality food and services at a reasonable value. Dining Services aims to offer a variety of nutritional menu items in a comfortable and convenient environment. SIUE offers various progressive dining venues including a contemporary food court, table service restaurant, catering services, cafeé’s, kiosks and convenience stores. Dining Services takes pride in achieving excellence and answering the demands of a growing university, while maintaining fiscal responsibility and integrity. About Learn about our sustainability efforts and catering services, and meet the staff. Daily Menu Download the Nutrislice app to view the daily menu and nutritional information. Dining Options Learn about the various dining establishments around campus and see their hours of operation. Special Diets Learn about special dietary needs. Employment Apply for a position within Dining Services. Contact Us Need more information? Meal Plans Event Services Morris University Center (MUC) Add Cougar Bucks Â"}