{"timestamp": 1772073219.274344, "content": "Supplemental Instruction - Learning Support Services | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Learning Support Services About Us Developmental Courses Tutoring Resource Center Writing Center Supplemental Instruction Meet the Team Supplemental Instruction Learning Support Services Supplemental Instruction What is SI? SI Sessions Schedule Staff SI Leaders Statistics Publications Connect Social at SIUE What is SI? The Supplemental Instruction (SI) program at SIUE is a non-remedial, institution-wide academic assistance program that increases student performance and retention. The SI program targets traditionally difficult academic courses — those that have an approximate 30% or higher rate of D or F grades and withdrawals — and provides weekly peer facilitated group study sessions. SI does not identify high-risk students, but rather identifies high-risk courses. SI is an established program with specific guidelines developed by Deanna C. Martin, Ph.D., at the University of Missouri-Kansas City . More than 3,500 institutions in the United States and 30 countries around the world offer academic assistance through the SI model. Key Program Elements SI emphasizes what to learn with how to learn. SI provides opportunities for students to improve their grades and understanding of course materials. SI participation is voluntary and open to all students in the targeted course. SI Leaders attend all the lectures for the targeted course and hold 2-3 group study sessions outside of class. SI is supervised by a trained professional staff member. SI is offered only in classes where faculty members support SI. SI Leaders have usually taken the designated course with the faculty member who is currently teaching the course. SI Leaders work to facilitate group interaction and provide study strategies for success, rather than lecture. How does it work? SI Leaders offer two to three 50-minute group study sessions a week, and one office hour. Sessions, which are informal, voluntary, and free, offer students an opportunity to discuss important concepts, develop study and test taking strategies, and focus on how to learn with what to learn. Leader office hours provide one-on-one practice. Who can be an SI leader? SI leaders are knowledgeable, qualified students who have taken the targeted SI course on campus and received a good grade. They should have an overall GPA of 3.0 or higher, be organized and good managers of their time, have good communication skills, and possess leadership ability. Leaders must be able to attend all SI course lectures, hold two to three 50-minute sessions a week, hold an office hour, attend leader training and bi-weekly SI leader meetings, complete and submit paperwork on time, and communicate regularly with the course professor, the students, and the SI staff. Being an SI leader is a rewarding experience. The leader becomes an \"expert\" in the course content, which can help with upper level courses. This position can be counted as a Co-op or Internship with transcript recognition and included on a resume. Leaders gain and improve leadership and communication skills. If you are interested in becoming an SI Leader, please complete the SI Leader Application . Who can attend SI? Supplemental Instruction is for all students in the targeted course. Students who attend receive extra study practice, can compare notes with other students, learn different study strategies, and hone their skills. Everyone can benefit from attending SI. In fact, students who attend SI regularly earn an average of a half to a whole letter grade higher than students who don't. What students are saying: \"I love SI!\" \"SI sessions helped me understand the material better and helped me increase my grade.\" \"SI is awesome; it really bridges the gap in learning.\" \"It's definitely the difference between an 'A' and a 'B.'\" \"I retained so much more material by attending SI. [Leader] is a great SI Leader and does a very good job at explaining concepts in ways that each individual is able to understand and keeps everybody engaged.\" \"[Leader] is very good at helping you fully understand the material and will give you different examples to make sure you fully get it.\" Which courses participate in SI? At SIUE, SI covers courses in: Biology (BIOL 140, BIOL 151, BIOL 240A/B, BIOL 250, BIOL 319) Chemistry (CHEM 113, CHEM 120A/B, CHEM 121A/B, CHEM 241A/B) Economics (ECON 111, ECON 112) Engineering (ECE 210, ME 262) Finance (FIN 320) Management Science (MS 250, MS 251) Mathematics (MATH 152) Nursing (NURS 240) Physics (PHYS 131, PHYS 132, PHYS 141, PHYS 142, PHYS 151, PHYS 152) What can faculty do to help? Faculty can: Post SI session information on the course Blackboard Add SI leaders to Blackboard so leaders can access course materials, email announcements and session materials, and generally market their sessions Encourage students to attend SI by making in-class announcements Meet periodically with SI leaders to discuss course expectations and student needs Inform leaders what materials and resources they can and cannot use in sessions SI Statement of Commitment to Diversity & Inclusion The Supplemental Instruction ( SI ) Program recognizes the importance of inclusivity and diversity in education at SIUE. SI is committed to creating a group study program which contributes to the “open, respectful, and welcoming climate” espoused in SIUE’s State m ent on Diversity . To demonstrate our commitment, the SI Program seeks to hire SI Leaders who represent the diverse student body we serve. In addition, beginning in Fall 2020 as part of our SI Leader training , we will require all SI Leaders and SI staff to attend one SIUE Diversity Day event or diversity lecture of their choice, each semester they are employed. The SI Program continues t o explore ways to create a diverse and inclusive environment for the SIUE students we serve, the SI Leaders, and SI staff. Â"}